benchmark/old_outputs/single_thread/sieve_new/uni_8/2026-04-17T19:59:09-04:00_9_1_1.5.txt
pgbench (19devel)
transaction type: multiple scripts
scaling factor: 1000
query mode: simple
number of clients: 2
number of threads: 1
maximum number of tries: 1
duration: 180 s
number of transactions actually processed: 2897636
number of failed transactions: 0 (0.000%)
latency average = 0.124 ms
initial connection time = 2.834 ms
tps = 16098.222560 (without initial connection time)
SQL script 1: pgscripts/uniform_select.sql
 - weight: 9 (targets 90.0% of total)
 - 2607734 transactions (90.0% of total)
 - number of transactions actually processed: 2607734 (tps = 14487.631404)
 - number of failed transactions: 0 (0.000%)
 - latency average = 0.089 ms
 - latency stddev = 0.039 ms
SQL script 2: pgscripts/uniform_update.sql
 - weight: 1 (targets 10.0% of total)
 - 289902 transactions (10.0% of total)
 - number of transactions actually processed: 289902 (tps = 1610.591157)
 - number of failed transactions: 0 (0.000%)
 - latency average = 0.436 ms
 - latency stddev = 0.776 ms
ratio: .28373569493801254